In [227]:
import pandas as pd

In [228]:
person_1={
    "first": "Teanie",
    "last": "Miosotis",
    "email": "miosotisteanie@gmail.com"
}

In [229]:
person_1["email"]

'miosotisteanie@gmail.com'

In [230]:
df1=pd.DataFrame(person_1, index=[0])

In [231]:
df1

    first      last                     email
0  Teanie  Miosotis  miosotisteanie@gmail.com

In [232]:
person_2={
    "first": ["Teanie"],
    "last": ["Miosotis"],
    "email": ["miosotisteanie@gmail.com"]
}

In [233]:
df2=pd.DataFrame(person_2, index=[0])

In [234]:
people={
    "first": ["Teanie", "Kim", "Aeeint"],
    "last": ["Miosotis", "Sovann", "Iimootss"],
    "email": ["miosotisteanie@gmail.com", "kimsovd@yahoo.fr", "aeeintiimootss@gmail.com"]
}

In [235]:
df=pd.DataFrame(people)

In [236]:
df

    first      last                     email
0  Teanie  Miosotis  miosotisteanie@gmail.com
1     Kim    Sovann          kimsovd@yahoo.fr
2  Aeeint  Iimootss  aeeintiimootss@gmail.com

In [237]:
df["first"]

0    Teanie
1       Kim
2    Aeeint
Name: first, dtype: object

In [238]:
df[[ "email","last"]]

                      email      last
0  miosotisteanie@gmail.com  Miosotis
1          kimsovd@yahoo.fr    Sovann
2  aeeintiimootss@gmail.com  Iimootss

In [239]:
df.columns #to get columns's names

Index(['first', 'last', 'email'], dtype='object')

In [240]:
df.iloc[[0, 1], 2]
# .iloc!= loc -->.iloc[number_row, number_columns]
#             -->.loc[number_row, columns_names]

0    miosotisteanie@gmail.com
1            kimsovd@yahoo.fr
Name: email, dtype: object

In [241]:
df.loc[[0, 2], ["first", "last"]]

    first      last
0  Teanie  Miosotis
2  Aeeint  Iimootss

In [242]:
df.set_index("email", inplace=True)
#to set the colmns email as the index

In [243]:
df

                           first      last
email
miosotisteanie@gmail.com  Teanie  Miosotis
kimsovd@yahoo.fr             Kim    Sovann
aeeintiimootss@gmail.com  Aeeint  Iimootss

In [244]:
df.index

Index(['miosotisteanie@gmail.com', 'kimsovd@yahoo.fr',
       'aeeintiimootss@gmail.com'],
      dtype='object', name='email')

In [245]:
df.loc["miosotisteanie@gmail.com", "last"]

'Miosotis'

In [246]:
df.iloc[0]

first      Teanie
last     Miosotis
Name: miosotisteanie@gmail.com, dtype: object

In [247]:
df.reset_index(inplace=True)
#to set back the index with number

In [248]:
df

                      email   first      last
0  miosotisteanie@gmail.com  Teanie  Miosotis
1          kimsovd@yahoo.fr     Kim    Sovann
2  aeeintiimootss@gmail.com  Aeeint  Iimootss

In [249]:
df_1=pd.DataFrame({'month': [1, 4, 7, 10], 
                  'year': [2012, 2014, 2013, 2014], 
                  'sale': [55, 40, 84, 31]})

In [250]:
df_1.set_index('month')

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [251]:
df_1.set_index(['year', 'month'])

            sale
year month
2012 1        55
2014 4        40
2013 7        84
2014 10       31

In [252]:
df_1.set_index([pd.Index([1, 2, 3, 4]), 'year'])

        month  sale
  year
1 2012      1    55
2 2014      4    40
3 2013      7    84
4 2014     10    31

In [253]:
filt=(df['last']=='Sovann')|(df['first']=='Teanie')
filt

0     True
1     True
2    False
dtype: bool

In [254]:
df.loc[~filt, 'email']

2    aeeintiimootss@gmail.com
Name: email, dtype: object

In [255]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [256]:
df.columns = ['Email','First_Name', 'Last_name']

In [257]:
df.columns=[x.lower() for x in df.columns]

In [258]:
df

                      email first_name last_name
0  miosotisteanie@gmail.com     Teanie  Miosotis
1          kimsovd@yahoo.fr        Kim    Sovann
2  aeeintiimootss@gmail.com     Aeeint  Iimootss

In [259]:
df.loc[2, ['last', 'email']]=['Doe', 'johndoe@gmail.com']

In [260]:
df

                      email first_name last_name last
0  miosotisteanie@gmail.com     Teanie  Miosotis  NaN
1          kimsovd@yahoo.fr        Kim    Sovann  NaN
2         johndoe@gmail.com     Aeeint  Iimootss  Doe

In [261]:
filt = (df['email']=='kimsovd@yahoo.fr')
df.loc[filt, 'last_name']

1    Sovann
Name: last_name, dtype: object

In [262]:
df['first_name']=df['first_name'].str.lower()
#to put them in lower case

In [263]:
df

                      email first_name last_name last
0  miosotisteanie@gmail.com     teanie  Miosotis  NaN
1          kimsovd@yahoo.fr        kim    Sovann  NaN
2         johndoe@gmail.com     aeeint  Iimootss  Doe

In [264]:
df['fname']=df['first_name'].str.upper()

In [265]:
df

                      email first_name last_name last   fname
0  miosotisteanie@gmail.com     teanie  Miosotis  NaN  TEANIE
1          kimsovd@yahoo.fr        kim    Sovann  NaN     KIM
2         johndoe@gmail.com     aeeint  Iimootss  Doe  AEEINT

In [266]:
df['email'].apply(len)

0    24
1    16
2    17
Name: email, dtype: int64

In [267]:
def update_email(email):
    return email.upper()

In [268]:
df['email'].apply(update_email)

0    MIOSOTISTEANIE@GMAIL.COM
1            KIMSOVD@YAHOO.FR
2           JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [269]:
df['email']=df['email'].apply(update_email)

In [270]:
df

                      email first_name last_name last   fname
0  MIOSOTISTEANIE@GMAIL.COM     teanie  Miosotis  NaN  TEANIE
1          KIMSOVD@YAHOO.FR        kim    Sovann  NaN     KIM
2         JOHNDOE@GMAIL.COM     aeeint  Iimootss  Doe  AEEINT

In [271]:
#df['email']=df['email'].apply( lambda x: x.lower() )

In [272]:
df

                      email first_name last_name last   fname
0  MIOSOTISTEANIE@GMAIL.COM     teanie  Miosotis  NaN  TEANIE
1          KIMSOVD@YAHOO.FR        kim    Sovann  NaN     KIM
2         JOHNDOE@GMAIL.COM     aeeint  Iimootss  Doe  AEEINT

In [273]:
df['first_name'].map({'kim': 'Devie', 'aeeint': 'bb1'})

0      NaN
1    Devie
2      bb1
Name: first_name, dtype: object

In [274]:
df['first_name']=df['first_name'].replace({'kim': 'Devie', 'aeeint': 'bb1'})

In [275]:
df

                      email first_name last_name last   fname
0  MIOSOTISTEANIE@GMAIL.COM     teanie  Miosotis  NaN  TEANIE
1          KIMSOVD@YAHOO.FR      Devie    Sovann  NaN     KIM
2         JOHNDOE@GMAIL.COM        bb1  Iimootss  Doe  AEEINT

In [276]:
df['email']=df['email'].str.lower()

In [277]:
df['full_name']=df['first_name']+" "+df['last_name']
df

                      email first_name last_name last   fname        full_name
0  miosotisteanie@gmail.com     teanie  Miosotis  NaN  TEANIE  teanie Miosotis
1          kimsovd@yahoo.fr      Devie    Sovann  NaN     KIM     Devie Sovann
2         johndoe@gmail.com        bb1  Iimootss  Doe  AEEINT     bb1 Iimootss

In [278]:
df.drop(columns=['first_name', 'last_name', 'last', 'fname'], inplace=True)

In [279]:
df

                      email        full_name
0  miosotisteanie@gmail.com  teanie Miosotis
1          kimsovd@yahoo.fr     Devie Sovann
2         johndoe@gmail.com     bb1 Iimootss

In [280]:
df['full_name'].str.split(' ', expand=True)

        0         1
0  teanie  Miosotis
1   Devie    Sovann
2     bb1  Iimootss

In [281]:
df[['first', 'last']]=df['full_name'].str.split(' ', expand=True)

In [282]:
df

                      email        full_name   first      last
0  miosotisteanie@gmail.com  teanie Miosotis  teanie  Miosotis
1          kimsovd@yahoo.fr     Devie Sovann   Devie    Sovann
2         johndoe@gmail.com     bb1 Iimootss     bb1  Iimootss

In [283]:
df.append({'first': 'Tony'}, ignore_index=True)

C:\Users\Teanie\AppData\Local\Temp\ipykernel_2256\67547244.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first': 'Tony'}, ignore_index=True)

                      email        full_name   first      last
0  miosotisteanie@gmail.com  teanie Miosotis  teanie  Miosotis
1          kimsovd@yahoo.fr     Devie Sovann   Devie    Sovann
2         johndoe@gmail.com     bb1 Iimootss     bb1  Iimootss
3                       NaN              NaN    Tony       NaN

In [285]:
avengers={
    'first': ['Tony', 'Steve'],
    'last': ['Stark', 'Rogers'],
    'email': ['stark@stark.stark', 'cap@america.revenge']
}

In [288]:
avengers=pd.DataFrame(avengers)
avengers

   first    last                email
0   Tony   Stark    stark@stark.stark
1  Steve  Rogers  cap@america.revenge